Revit 2026 API

# FacetingUtils Class

---

This class is used to convertTrianglesToQuads a triangulated structure into a structure in which some of the triangles have been consolidated into quadrilaterals.

SystemObject Autodesk.Revit.DBFacetingUtils

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class FacetingUtils
```
```vb
Public NotInheritable Class FacetingUtils
```
```cpp
public ref class FacetingUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type FacetingUtils = class end
```

The FacetingUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ConvertTrianglesToQuads | Replaces pairs of adjacent, coplanar triangles by quadrilaterals. |

#### Reference

Autodesk.Revit.DB Namespace